//---------------------------------------------------------------------------
// 2025 STL 화56목78	3월 11일 화요일								(2주 1일)
//---------------------------------------------------------------------------
// 많은 수의 자료를 처리하기
//---------------------------------------------------------------------------
#include <iostream>
#include <random>
#include <print>
#include "save.h"
using namespace std;							

// 랜덤 int 1000개를 생성하여 화면에 출력하라

default_random_engine dre;
std::uniform_int_distribution uid{ 0, 999'9999 };

// [문제] 랜덤 int 1000개를 메모리에 저장하라
// 가장 큰 값을 찾아 화면에 출력하라

//--------
int main()
//--------
{
	for (int i{}; i < 1000; ++i)
		print("{:8}", uid(dre));
	cout << endl;

	save("메인.cpp");
}